Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: For other devices it will return 0, and you should use the device_mouse_raw_x()and device_mouse_raw_y() functions instead.
zh_cn: 对于其他设备，它将返回0，您应该使用device_mouse_raw_x()和device_mouse_raw_y()函数。

source: For strings and integer values this is clear but for real numbers, due to floating point round-off errors, seemingly equal numbers can easily become unequal.
zh_cn: 对于字符串和整数值，这一点很清楚，但对于实数，由于浮点舍入错误，看起来相等的数很容易变成不等的。

source: For such objects simply setting the density of a fixture to 0 will mean that the physics will assume that the object is intended to be static.
zh_cn: 对于这样的物体，简单地将固定物的密度设置为0将意味着物理学将假设物体是静态的。

source: For that the player would need to exit the game and restart that way, so take care when using this function.
zh_cn: 为此，玩家需要退出游戏，然后重新启动，所以使用此函数时要小心。

source: For that you can use this function to delete the old ones before creating the new ones (if necessary).
zh_cn: 为此，您可以通过此函数删除旧的，然后再创建新的(如有必要)。

source: For that you should use the function ds_map_destroy().
zh_cn: 为此，您应该使用函数ds_map_destroy()。

source: For that you should use the function instance_exists().
zh_cn: 为此，您应该使用函数instance_exists()。

source: For that you would call this function, using the index of the virtual key that you want to see (previously created and stored using virtual_key_add()) which will draw a coloured rectangle to represent the key on the screen.
zh_cn: 为此，您可以调用此函数，使用您想要查看的虚拟键的索引(之前使用virtual_key_add()创建和存储)，这将绘制一个彩色矩形来表示屏幕上的键。

source: For the mouse button you can supply one of the constants listed on this page.
zh_cn: 对于鼠标按钮，您可以提供本页列出的常量之一。

source: For the sprite you can use the instance variable sprite_index to get the current sprite that is assigned to the instance running the code, or you can use any other sprite asset.
zh_cn: 对于精灵，您可以使用实例变量 sprite_index 来获取分配给运行代码的实例的当前精灵，或者您可以使用任何其他精灵资源。

source: For this to collision to resolve correctly, the instance running the code must have a valid collision mask (either for the sprite itself, or through the mask_index) and it will only register collisions with those instances that also have a valid mask.
zh_cn: 为了正确解决这个碰撞，运行代码的实例必须有一个有效的碰撞掩码(对于sprite本身，或者通过mask_index ),并且它将只注册与那些也有有效掩码的实例的碰撞。

source: For this, you need to have stored the index of the joint previously in a variable and then you can switch the motor on or off by using this function and setting the "motor" argument to true or false.
zh_cn: 为此，您需要预先将关节的索引存储在一个变量中，然后您可以通过使用此函数并将"马达"参数设置为true或false来打开或关闭马达。

source: Four component unsigned byte values (from 0 to 255)
zh_cn: 四分量无符号字节值(从0到255)

source: Four component values (r, g, b, a)
zh_cn: 四个分量值 (r, g, b, a)

source: Four floating point values
zh_cn: 四个浮点值

source: Freed sounds will not be available for playing, and if multiple instances of the sound are being played they will all be stopped.
zh_cn: 释放的声音将不能播放，如果多个实例的声音正在播放，他们将全部停止。

source: Freeing the queue will stop any sound that is be playing, and you cannot delete the buffer that a sound is being streamed from until the queue it is assigned to has been freed.
zh_cn: 释放该队列将停止正在播放的任何声音，并且在分配给该队列的队列被释放之前，不能删除用于播放声音的缓冲区。

source: Friction is one of the "built in" properties that instances can have and can be used to slow the instance down over time when the speed is other than zero.
zh_cn: 摩擦是实例可以拥有的"内置"属性之一，可以用来随着时间的推移减慢实例的速度，当速度不是0时。

source: Friction is the force that resists the relative motion of material elements sliding against each other, which in the GameMaker physics world, translates as the loss of momentum caused by the collision of two instances with fixtures bound to them.
zh_cn: 摩擦力是阻止材料元素相互滑动的相对运动的力，在GameMaker物理世界中，这种力被解释为两个实例与绑定到它们的夹具碰撞所导致的动量损失。

source: Full Image - The bounding box will be set to use the full width and height of the sprite, regardless of the tolerance and "empty" pixels
zh_cn: 完整图像-边界框将被设置为使用精灵的完整宽度和高度，而不考虑容差和"空"像素

source: Gain is usually calculated as a value from 0 to 1, but on some platforms you can have a gain of greater than 1, although a value of 1 is considered "full volume" and anything greater may introduce audio clipping.
zh_cn: 增益通常计算为0到1之间的值，但在某些平台上，您可以使用大于1的增益，尽管值1被视为"最大音量"，大于1的值可能会导致音频削波。

source: Game is not being played in a browser
zh_cn: 游戏不是在浏览器中进行的

source: GameMaker provides this function (as well as others) to permit the user to make their own colours.
zh_cn: GameMaker提供了此函数(以及其他功能)来允许用户制作自己的颜色。

source: GameMaker updates things based on the room speed, so that if you set it to ,say, 30, GameMaker will run 30 steps in the course of a second.
zh_cn: GameMaker会根据房间速度进行更新，所以如果你设置为30步，GameMaker会在一秒钟内跑30步。

source: GameMaker will put objects to sleep to save simulation cycles when an instance is at rest and not in collision with another instance
zh_cn: 当一个实例处于静止状态且不与另一个实例发生碰撞时，GameMaker会让对象休眠以节省模拟周期

source: Games can have achievements with no completion value and so you can use this function to increment those achievement by a given amount.
zh_cn: 游戏可以拥有没有完成值的成就，所以你可以使用此函数来增加成就的数量。

source: Gets the base time zone being used for all the rest of the date and time functions.
zh_cn: 获取用于所有其余日期和时间函数的基本时区。

source: Gets the distance between the anchor x/y coordinates and the local x/y coordinates.
zh_cn: 获取定位点x/y坐标和局部x/y坐标之间的距离。

source: Gets the game speed using frames per second.
zh_cn: 以每秒帧数获取游戏速度。

source: Gets the game speed using microseconds per frame.
zh_cn: 以每帧微秒为单位获取游戏速度。

source: Globally the method works as follows: it first tries to move straight towards the goal, looking a number of steps ahead which can be set with the parameter "ahead" (default value is 3).
zh_cn: 总体来说，该方法工作如下:它首先尝试直接向目标移动，向前看许多步，这些步可以用参数"ahead"设置(默认值为3)。

source: Go backwards along the path again (achieved by reversing the path movement speed)
zh_cn: 再次沿路径后退(通过逆转路径移动速度实现)

source: Google Chrome
zh_cn: 谷歌Chrome浏览器

source: Hats generally refer to up/down/left/right buttons, and note that on the Windows target, hats are only available on DirectInput controllers (so, from slot 4 upwards).
zh_cn: 帽子通常指上/下/左/右按钮，并注意在 Windows 目标上，帽子仅在 方向输入 控制器上可用（因此，从插槽 4 向上）。

source: Here are some images to illustrate...
zh_cn: 这里有一些图片来说明...

source: Here is an example image to help illustrate:
zh_cn: 这里有一个示例图像来帮助说明:

source: Here is an illustration of how it works:
zh_cn: 下面是它的工作原理:

source: Here is an illustration to help you visualise this process:
zh_cn: 这里有一个插图可以帮助你想象这个过程:

source: Here is an illustration:
zh_cn: ). 下面是一个例子:

source: Here is an image of how it looks:
zh_cn: 这是它看起来的样子:

source: Here is an image to help explain:
zh_cn: 下面这张图片可以帮助解释:

source: Here is an image to help you visualise how this works:
zh_cn: 下面这张图片可以帮助你了解这是如何工作的:

source: Here is an image to illustrate damping:
zh_cn: 这里有一个图像来说明阻尼:

source: Hidden files
zh_cn: 隐藏文件

source: High-pass Filter
zh_cn: 高通滤波器

source: Horizontal alignment.
zh_cn: 水平对齐。

source: Horizontal position of the cell in the grid
zh_cn: 网格中单元格的水平位置

source: Horizontal position of the cell to clear
zh_cn: 要清除的单元格的水平位置

source: How dark the colour is
zh_cn: 颜色有多深

source: How far outside the room, in pixels, the object must be to initiate wrapping.
zh_cn: 对象必须在房间外多远(以像素为单位)才能开始环绕。

source: How far through the path to check.
zh_cn: 要检查路径有多远。

source: How long to wait before invoking the callback
zh_cn: 在调用回调之前要等待多长时间

source: How many entries should be checked.
zh_cn: 应检查多少条目。

source: How many entries should be searched.
zh_cn: 应该搜索多少个条目。

source: How many entries should be shuffled.
zh_cn: 应该置乱多少个条目。

source: How many times to multiply x by itself.
zh_cn: x自己乘多少次。

source: How much of each colour should be merged.
zh_cn: 每种颜色应该合并多少。

source: How much should randomly be added or subtracted from the particle's direction per step.
zh_cn: 每步粒子的方向应该随机增加或减少多少。

source: How much should randomly be added or subtracted from the particle's speed per step.
zh_cn: 粒子每一步的速度应该随机增加或减少多少。

source: How much should randomly be added or subtracted from the particles size per step.
zh_cn: 每一步的颗粒大小应随机增加或减少多少。

source: How much the particle direction should increase or decrease per step.
zh_cn: 每步粒子方向应该增加或减少多少。

source: How much the particle should increase or decrease per step.
zh_cn: 粒子每步应该增加或减少多少。

source: How much the particle speed should increase or decrease per step.
zh_cn: 粒子速度每步应该增加或减少多少。

source: How much torque you apply to get the desired rotation all depends on the size and density of the fixture you assign to your instance, as both these properties go towards defining its mass, which defines its inertia, which affects torque!
zh_cn: 应用多大的扭矩来获得所需的旋转完全取决于分配给实例的夹具的大小和密度，因为这两个属性都用于定义其质量，从而定义其惯性，进而影响扭矩！

source: How saturated the colour is
zh_cn: 颜色的饱和度

source: However for a user defined mask (2) you will have to set these values.
zh_cn: 但是，对于用户定义的掩码(2)，您必须设置这些值。

source: However if it is flagged as false, each time you return to the room it will be reset to its initial state.
zh_cn: 然而，如果它被标记为false，每次你回到房间，它将被重置为其初始状态。

source: However if the room is persistent, the background will be removed unless room persistence is switched off again.
zh_cn: 然而，如果房间是持久化的，背景将被删除，除非再次关闭房间持久化。

source: However if the room is persistent, the sprite will be removed unless room persistence is switched off again.
zh_cn: 然而，如果房间是持久的，精灵将被删除，除非再次关闭房间持久性。

source: However if the room is persistent, the tile map will be removed unless room persistence is switched off again.
zh_cn: 但是，如果房间是持久化的，那么tile map将被移除，除非再次关闭房间持久化。

source: However if you are manipulating this surface and wish to draw it yourself, then this function gives you an easy way to find exactly where within the display or window that the surface was being drawn so that you can then draw it there yourself, or align GUI images or post draw images to it.
zh_cn: 但是，如果您正在操作这个表面并希望自己绘制它，那么此函数为您提供了一个简单的方法来准确地找到在显示器或窗口中绘制表面的位置，这样您就可以自己在那里绘制它，或者将GUI图像或后期绘制图像与它对齐。

source: However if you pass in the keyword global, each entry in the array will be a string of the variable name that corresponds to an global scope variable.
zh_cn: 但是，如果传入关键字global，则数组中的每个条目将是对应于全局作用域变量的变量名字符串。

source: However in very special occasions you may need to offset the center of mass or change the inertia and that is when you would use this function.
zh_cn: 然而，在非常特殊的情况下，你可能需要偏移重心或改变惯性，这时你会用到此函数。

source: However note that in the physics world rotations are calculated in the opposite way to the normal GameMaker game world, meaning that vector functions like point_direction()should have their return values modified (simply making positive to negative should resolve this).
zh_cn: 然而，注意，在物理世界中，旋转的计算方式与正常的GameMaker游戏世界相反，这意味着像point_direction()这样的向量函数应该修改其返回值(简单地将正数变为负数应该可以解决这个问题)。

source: However on some older devices and specific chipsets this may result in poorer performance.
zh_cn: 然而，在一些旧设备和特定芯片组上，这可能会导致较差的性能。

source: However this can sometimes lead to problems, especially if you have a number of instances with fixtures that are side by side when a room starts (think of a tower made of various instances with fixtures) as with them being "awake" they will move and possibly change position due to the sudden start of gravity and collisions affecting them.
zh_cn: 然而，这有时会导致问题，特别是当一个房间启动时，你有许多夹具并排在一起的实例(想象一个由各种夹具实例组成的塔)，因为它们处于"清醒"状态，它们将移动，并可能由于突然开始的重力和碰撞影响它们而改变位置。

source: However this function can be used to switch these internal checks off (ie: remove them completely from the compiled game), giving a speed boost to your final project.
zh_cn: 然而，此函数可以用来关闭这些内部检查(例如:从编译的游戏中完全删除它们)，提高你最终项目的速度。

source: However this is easily mimicked by the use of the following script:
zh_cn: 但是，这很容易通过使用以下脚本来模仿:

source: However this may not always be useful, particularly as some devices run the exe from a *.zip file, so this would return the same no matter where the game is actually running from.
zh_cn: 然而，这可能并不总是有用的，特别是当一些设备从*.zip文件运行exe时，所以无论游戏从哪里运行，这都将返回相同的结果。

source: However, by using this function to set repeat to true the texture is repeated automatically over all models and primitives.
zh_cn: 但是，通过使用此函数将repeat设置为true，纹理会在所有模型和基本体上自动重复。

source: However, depending on how big or small you need your circles to be, you may find that changing this value can help increase the performance of your game, or make the circles look better.
zh_cn: 然而，根据你需要的圆圈大小，你可能会发现改变这个值有助于提高游戏的性能，或使圆圈看起来更好。

source: However, for special effects or for pausing the game, you can set this to false and it will prevent any updates being carried out on the given particle system unless explicitly commanded by the use of the function part_system_update() or you use this function again to turn automatic updates on.
zh_cn: 但是，对于特殊效果或暂停游戏，您可以将其设置为 false 并且它将阻止在给定粒子系统上执行任何更新，除非使用函数 part_system_update() 明确命令或者您再次使用此函数打开自动更新。

source: However, for the physics functions that may not be enough and you may want things to be updated at a slightly faster speed to increase stability or precision.
zh_cn: 然而，对于物理函数来说，这可能还不够，你可能希望更新的速度稍微快一点，以增加稳定性或精确度。

source: However, if the IDE has set the animation speed for the sprite used to be calculated as Frames Per Second, then the speed value given is a literal frames per second value, so setting this to 5, for example, will set the animation to loop 5 frames every second that the game runs.
zh_cn: 但是，如果IDE已经为sprite设置了动画速度，该速度过去是按每秒帧数计算的，那么给定的速度值就是每秒帧数，因此，例如，将其设置为5将使动画在游戏运行时每秒循环5帧。

source: However, if you delete the list position individually, the DS list it contained will not be garbage collected and you should call the appropriate DS list destroy function before deleting the item from the parent list position.
zh_cn: 但是，如果您单独删除列表位置，它包含的DS列表将不会被垃圾收集，您应该在从父列表位置删除该项之前调用适当的DS列表销毁函数。

source: However, if you delete the list position individually, the data structure it contained will not be garbage collected and you should call the appropriate DS map destroy function before deleting the parent list position.
zh_cn: 但是，如果您单独删除列表位置，它包含的数据结构将不会被垃圾收集，您应该在删除父列表位置之前调用适当的DS map destroy函数。

source: However, if you generate a polygon with any cavities, the points within will be ignored and a convex shape will be created for the particle group.
zh_cn: 但是，如果生成一个带有任何空腔的多边形，则会忽略其中的点，并为粒子组创建一个凸形状。

source: However, if you then load the file using the function buffer_load_async(), you do not need to supply the "default" part of the path either (but any other file function will require it, except on consoles Xbox One, PS4 and Nintendo Switch).
zh_cn: 然而，如果你使用函数buffer_load_async()加载文件，你也不需要提供路径的"默认"部分(但是任何其他文件函数都需要它，除了在Xbox One、PS4和任天堂Switch上)。

source: However, if you use this function to set the window size, the 1:1 ratio is maintained, even though the image is scaled to fit the new window size.
zh_cn: 但是，如果您通过此函数来设置窗口大小，即使图像被缩放以适合新的窗口大小，1:1的比例也会保持不变。

source: However, if you write another piece of data, also 1 byte in size, then do a buffer_tell(), you'll get a return value of 5 as the alignment has "padded" the data to that position.
zh_cn: 但是，如果您写入另一段数据，同样是1字节大小，然后执行buffer_tell()，您将得到返回值5，因为对齐已经将数据"填充"到该位置。

source: However, it may be necessary for you to change a given piece of data without wanting to change the current seek position, and that's when you would use this function.
zh_cn: 但是，您可能需要更改给定的一段数据，而不想更改当前的搜索位置，这时您就需要使用此函数。

source: However, it may be necessary for you to read a given piece of data without wanting to change the current seek position, and that's when you would use this function.
zh_cn: 但是，您可能需要读取一段给定的数据，而不想改变当前的查找位置，这时您就要使用此函数了。

source: However, it will not delete any other file.
zh_cn: 但是，它不会删除任何其他文件。

source: However, should you set the phy_speed_x, phy_speed_y or phy_angular_velocity variables for an instance that has had such a fixture bound to it, it will be converted into a kinematic object and begin movement.
zh_cn: 但是，如果为绑定了此类夹具的实例设置phy_speed_x、phy_speed_y或phy_angular_velocity变量，该实例将被转换为运动学对象并开始运动。

source: However, there are moments when you need to pause the simulation as (for example) the device os has paused, and so you would use this function.
zh_cn: 但是，有时您需要暂停模拟，例如设备操作系统已经暂停，因此您可以通过此函数。

source: However, this is not always what you wish to happen and there are moments when you may want something to be drawn over everything else, no matter what its z value is.
zh_cn: 然而，这并不总是你所希望发生的，有时候你可能想要一些东西覆盖其他东西，不管它的z值是多少。

source: However, to be able to do that you must first call this function to get the "handle" of the shader constant that you will want to change.
zh_cn: 然而，为了能够做到这一点，你必须首先调用此函数来获得你想要更改的着色器常量的"句柄"。

source: However, to be able to do that you must first call this function to get the "handle" of the shader sampler that you will want to set.
zh_cn: 然而，为了能够做到这一点，你必须首先调用此函数来获得你想要设置的着色采样器的"句柄"。

source: However, to get the necessary precision with the physics functions they are made to do several calculations each step which are called "iterations" the number of which are controlled by this function.
zh_cn: 然而，为了用物理函数得到必要的精度，他们每一步都要做一些计算，这些计算被称为"迭代"，迭代的次数由此函数控制。

source: However, unlike ds_priority_delete_max(), this function will not remove the value from the queue.
zh_cn: 然而，与ds_priority_delete_max()不同的是，此函数不会从队列中删除值。

source: However, unlike ds_priority_delete_min(), this function will not remove the value from the queue.
zh_cn: 然而，与ds_priority_delete_min()不同的是，此函数不会从队列中删除值。

source: However, when flagged as persistent, the system will be carried to the next room when the room is changed, and if the following room does not have a layer with the same name or depth as the one assigned, then a new layer will be created for the system that is persisting across the rooms, and it will be named the same as original layer.
zh_cn: 然而，当标记为持久化时，当房间发生变化时，系统将被带到下一个房间，如果接下来的房间没有一个与所分配的具有相同名称或深度的层，那么将为跨房间持久化的系统创建一个新层，它将被命名为与原始层相同的层。

source: However, when reading from disk, working_directory can be either the local storage or the area where the included files are stored.
zh_cn: 但是，当从磁盘读取时，working_directory可以是本地存储，也可以是存储包含文件的区域。

source: However, you can also set the global mask using this function and all sounds played normally will be heard from the listeners flagged by this mask, without the need to set the mask for each sound individually.
zh_cn: 但是，您也可以使用此函数设置全局掩码，所有正常播放的声音将从该掩码标记的侦听器中听到，而不需要为每个声音单独设置掩码。

source: However, you can assign further sets to further tracks (1 and above) and in this way have your sprite play two (or more) animations at the same time.
zh_cn: 但是，您可以将更多的集合指定给更多的轨迹(1及以上)，这样就可以让sprite同时播放两个(或更多)动画。

source: However, you may need to toggle this view on and off, so you can also hide the virtual key with this function, using the index of the virtual key that you want to hide (previously created and stored using virtual_key_add()).
zh_cn: 但是，您可能需要打开和关闭这个视图，因此您也可以使用此函数隐藏虚拟键，使用您想要隐藏的虚拟键的索引(以前使用virtual_key_add()创建和存储)。

source: Ideally the sprite being used to generate the new alpha map should be grey-scale, with the white areas having an equivalent alpha value of 1 (opaque), the black areas being equivalent to alpha 0 (transparent), and the grey areas being an alpha in between 0 and 1.
zh_cn: 理想情况下，用于生成新的alpha映射的精灵应该是灰色的，白色区域的alpha值等于1(不透明)，黑色区域的alpha值等于0(透明)，灰色区域的alpha值介于0和1之间。

source: If a DS map has a list added in this way, destroying the parent map will also destroy the contained lists and free their memory, and calling ds_map_clear() on the parent map will also destroy and clean up any flagged lists.
zh_cn: 如果一个DS map 有一个以这种方式添加的列表，销毁父map也将销毁包含的列表并释放它们的内存，并且在父map上调用ds_map_clear()也将销毁并清除所有标记的列表。

source: If a DS map has another map added in this way, then destroying the parent map will also destroy the contained maps and free their memory, and calling ds_map_clear() on the parent map will also destroy and clean up any flagged maps.
zh_cn: 如果一个DS map以这种方式添加了另一个map，那么销毁父映射也将销毁包含的映射并释放它们的内存，并且在父映射上调用ds_map_clear()也将销毁和清除任何标记的映射。

source: If a negative value, it will instead create a fraction chance one is created (eg -3 would mean that one is created every 3 or so steps).
zh_cn: 如果是一个负值，它将创建一个小概率被创建(例如-3意味着每3步左右创建一个)。

source: If any of those assets are drawn with their own colour value changed, this value will be ignored.
zh_cn: 如果绘制这些资源时更改了它们自己的颜色值，该值将被忽略。

source: If both instances were moving then the second instance will have its movement speed modified to match that of the first instance.
zh_cn: 如果两个实例都在移动，那么第二个实例的移动速度将被修改以匹配第一个实例的移动速度。

source: If false is returned then a path is still generated, but it will only run up to the position where the path was blocked.
zh_cn: 如果返回false，那么仍然会生成一个路径，但是它只会运行到路径被阻塞的位置。

source: If false, indicates that texture pages are automatically loaded if a sprite is rendered from an unloaded texture group
zh_cn: 如果为false，表示如果从未加载的纹理组渲染精灵，纹理页面将自动加载

source: If false, the backcol argument is disregarded.
zh_cn: 如果为false，则忽略backcol参数。

source: If it does the function will return true otherwise it will return false.
zh_cn: 如果是，函数将返回true，否则将返回false。

source: If it does the function will return true, otherwise it will return false.
zh_cn: 如果是，函数将返回true，否则将返回false。

source: If it has been occupied or the position being checked is out of the grids bounds then the function will return -1 otherwise it will return 0.
zh_cn: 如果它已经被占用或者被检查的位置超出了网格边界，那么函数将返回-1，否则将返回0。

source: If it has then the function returns true otherwise it returns false.
zh_cn: 如果有，则函数返回true，否则返回false。

source: If it is a unique sound ID that you use, then the position will change immediately to the new time given, and if it is a Asset Browser asset then all further plays of the given sound will start at the new time.
zh_cn: 如果它是您使用的唯一声音ID，则位置将立即更改为给定的新时间，如果它是资源浏览器资源，则给定声音的所有进一步播放将在新时间开始。

source: If it is an index of a playing sound, then only that instance will be changed, however when using a sound asset from the Asset Browser, all further instances being played of that sound will be changed.
zh_cn: 如果它是正在播放的声音的索引，则只有该实例将被更改，但是当从资源浏览器中使用声音资源时，该声音的所有正在播放的实例都将被更改。

source: If it is filled you can define the individual colours for each corner point and if these colours are not the same, you will get a gradient effect from one to the other (the colour settings will over-ride the base colour set with the function draw_set_colour()).
zh_cn: 如果它被填充，你可以为每个角点定义单独的颜色，如果这些颜色不相同，你将得到从一个到另一个的渐变效果(颜色设置将使用draw_set_color()函数覆盖基础颜色设置)。

source: If it is filled you can define the individual colours for the centre and the edges, and if these colours are not the same, you will get a gradient effect from one to the other (the colour settings will over-ride the base colour set with the function draw_set_colour()).You can define how precise the drawing of the corners is with the function draw_set_circle_precision(), but the corners are always drawn with a fixed radius.
zh_cn: 如果它被填充，你可以为中心和边缘定义单独的颜色，如果这些颜色不相同，你将得到从一个到另一个的渐变效果(颜色设置将用draw_set_color()函数覆盖基础颜色设置)。您可以使用draw_set_circle_precision()函数定义绘制角的精确度，但是角总是以固定的半径绘制。

source: If it is filled you can define the interior and exterior fill colours.
zh_cn: 如果它是填充的，你可以定义内部和外部填充颜色。

source: If it is present the function will return true otherwise it will return false.
zh_cn: 如果存在，此函数将返回true，否则将返回false。

source: If it is set to false, all positioning must be dealt with through the collision event.
zh_cn: 如果设置为false，所有定位都必须通过碰撞事件来处理。

source: If it returns true then alpha-blending is enabled, and if it returns false it is disabled.
zh_cn: 如果它返回true，则启用alpha混合，如果它返回false，则禁用alpha混合。

source: If it returns true there is no need to call the achievement_login() function.
zh_cn: 如果它返回true，则不需要调用achievement_login()函数。

source: If left unspecified the message will be sent to everyone in the game.
zh_cn: 如果不指定，消息将会发送给游戏中的每个人。

source: If less than or equal to 0 no clamping is performed.
zh_cn: 如果小于或等于0，则不执行钳位。

source: If more than one value has the same priority, then any one of them could be returned in any order, but all other values with the same priority will still be in the queue.
zh_cn: 如果多个值具有相同的优先级，那么它们中的任何一个都可以以任何顺序返回，但具有相同优先级的所有其他值仍将在队列中。

source: If no browser is present then the window size is returned.
zh_cn: 如果没有浏览器，则返回窗口大小。

source: If no camera is assigned, the function will return -1.
zh_cn: 如果没有指定相机，此函数将返回-1。
